Autodesk.Revit.DB.FabricationConfiguration.GetAllStiffenerIds
Gets all available stiffener identifiers.
Returns:
Returns an array of available stiffener identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.StiffenerExists(System.Int32)
Checks to see if the specified stiffener exists in the fabrication database.
stiffenerId:
The stiffener identifier to check.
Returns:
Returns true if the stiffener exists.
Since:
2027

Autodesk.Revit.DB.FabricationConfiguration.GetStiffenerName(System.Int32)
Gets the stiffener name from its database identifier.
stiffenerId:
The stiffener database identifier.
Returns:
The stiffener name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stiffener does not exist.
Since:
2027

Autodesk.Revit.DB.FabricationConfiguration.GetAllAirturnIds
Gets all available air turn identifiers.
Returns:
Returns an array of available air turn identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.AirturnExists(System.Int32)
Checks to see if the specified air turn exists in the fabrication database.
airturnId:
The air turn identifier to check.
Returns:
Returns true if the seam exists.
Since:
2027

Autodesk.Revit.DB.FabricationConfiguration.GetAirturnName(System.Int32)
Gets the airturn name from its database identifier.
airturnId:
The air turn database identifier.
Returns:
The air turn name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The air turn does not exist.
Since:
2027

Autodesk.Revit.DB.FabricationConfiguration.GetAllSeamIds
Gets all available seam identifiers.
Returns:
Returns an array of available seam identifiers.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SeamExists(System.Int32)
Checks to see if the specified seam exists in the fabrication database.
seamId:
The seam identifier to check.
Returns:
Returns true if the seam exists.
Since:
2027

Autodesk.Revit.DB.FabricationConfiguration.GetSeamName(System.Int32)
Gets the seam name from its database identifier.
seamId:
The seam database identifier.
Returns:
The seam name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The seam does not exist.
Since:
2027